SilenceLY05/STM32F103HAL/21-DMA/DMA—存储器到外设模式/User/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  fire
  * @version V1.0
  * @date    2013-xx-xx
  * @brief   
  ******************************************************************************
  * @attention
  *
  * 实验平台:野火 F103 STM32 开发板 
  * 论坛    :http://www.firebbs.cn
  * 淘宝    :https://fire-stm32.taobao.com
  *
  ******************************************************************************
  */ 

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx.h"
#include "bsp_led.h"
#include "bsp_dma.h"
#include "bsp_usart.h"


static void Delay(__IO uint32_t nCount);
void SystemClock_Config(void); 
extern UART_HandleTypeDef UartHandle; 
extern DMA_HandleTypeDef DMA_Handle;
extern uint8_t SendBuff[SENDBUFF_SIZE];

/**
  * @brief  主函数
  * @param  无
  * @retval 无
  */
int main(void)
{
	uint16_t i;

	/* 系统时钟初始化成72 MHz */
	SystemClock_Config();
	Debug_USART_Config();

	/* LED 端口初始化 */
	LED_GPIO_Config(); 
	
	USART_DMA_Config();
	
	printf("\r\n USART1 DMA TX测试 \r\n");
	
		/* 填写将要发送的数据 */
	for(i=0;i<SENDBUFF_SIZE;i++)
	{
		SendBuff[i] = 'a';
	}
	

	
	/*为演示DMA持续运行而CPU还能处理其它事情，持续使用DMA发送数据，量非常大，
  *长时间运行可能会导致电脑端串口调试助手会卡死，鼠标乱飞的情况，
  *或把DMA配置中的循环模式改为单次模式*/
	
	
	/* USART1向DMA发出TX请求 */
	HAL_UART_Transmit_DMA(&UartHandle,(uint8_t *)SendBuff,SENDBUFF_SIZE);
  
	
	while (1)
	{		
		LED1_TOGGLE;
		Delay(0xFFFFFF);
	}
}


static void Delay(__IO uint32_t nCount)
{
	for(;nCount != 0;nCount--);
}




/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL (HSE)
  *            SYSCLK(Hz)                     = 72000000
  *            HCLK(Hz)                       = 72000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 2
  *            APB2 Prescaler                 = 1
  *            HSE Frequency(Hz)              = 8000000
  *            HSE PREDIV1                    = 1
  *            PLLMUL                         = 9
  *            Flash Latency(WS)              = 2
  * @param  None
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef clkinitstruct = {0};
  RCC_OscInitTypeDef oscinitstruct = {0};
  
  /* Enable HSE Oscillator and activate PLL with HSE as source */
  oscinitstruct.OscillatorType  = RCC_OSCILLATORTYPE_HSE;
  oscinitstruct.HSEState        = RCC_HSE_ON;
  oscinitstruct.HSEPredivValue  = RCC_HSE_PREDIV_DIV1;
	oscinitstruct.HSIState = RCC_HSI_ON;
  oscinitstruct.PLL.PLLState    = RCC_PLL_ON;
  oscinitstruct.PLL.PLLSource   = RCC_PLLSOURCE_HSE;
  oscinitstruct.PLL.PLLMUL      = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&oscinitstruct)!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }

  /* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 
     clocks dividers */
  clkinitstruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  clkinitstruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  clkinitstruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  clkinitstruct.APB2CLKDivider = RCC_HCLK_DIV1;
  clkinitstruct.APB1CLKDivider = RCC_HCLK_DIV2;  
  if (HAL_RCC_ClockConfig(&clkinitstruct, FLASH_LATENCY_2)!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }
}


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
